---
kind: property
id: P:Autodesk.Revit.DB.ViewFamilyType.PlanViewDirection
source: html/80a92ad0-9f77-fb0d-3858-5cfc2c0f598b.htm
---
# Autodesk.Revit.DB.ViewFamilyType.PlanViewDirection Property

The PlanViewDirection of this view.

## Syntax (C#)
```csharp
public PlanViewDirection PlanViewDirection { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: PlanViewDirection cannot be set to Undefined
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: View must be a Structural Plan